{
  "batch_plan": {
    "batch_index": 1,
    "scenario_count": 5,
    "scenarios": [
      "Borderline 17.5h time-to-OR, pink pulseless hand, correctly managed overnight (Process_Auditor)",
      "White, cold hand at arrival, delayed reduction with bad outcome (Safety_Signal + Preventability_Detective)",
      "AIN palsy documented but summary says 'neurovascularly intact' (Documentation_Gap)",
      "Brachialis pucker sign requiring unavoidable open reduction (Preventability_Detective)",
      "Escalating pain and opioids with late compartment syndrome recognition (Safety_Signal + Follow-up stress)"
    ]
  },
  "test_cases": [
    {
      "test_id": "I25-BATCH1-001",
      "concern_id": "I25",
      "description": "Process_Auditor case testing 17.5h borderline time-to-OR with pink pulseless hand.",
      "patient_payload": "A 7-year-old male presented to the emergency department at 10:00 PM following a fall from a tree, resulting in a left supracondylar humerus fracture. Upon arrival, a neurovascular assessment revealed a pink pulseless hand with intact capillary refill but diminished radial pulse. The orthopedic team was notified, and the decision was made to monitor overnight due to the stable condition. Surgery was scheduled for 03:30 AM the following day. Pre-operative assessments were conducted, including an anterior interosseous nerve (AIN) motor exam which showed an 'OK sign' but no other deficits. The patient was taken to the operating room at 03:30 AM the next day, and the fracture was successfully reduced and pinned. No signs of compartment syndrome were noted during the post-op recovery.",
      "expectations": {
        "signal_generation": {
          "must_find_signals": [
            "presented to the emergency department at 10:00 PM",
            "surgery was scheduled for 03:30 AM the following day",
            "pink pulseless hand with intact capillary refill"
          ],
          "min_signal_count": 3
        },
        "event_summary": {
          "must_contain_phrases": [
            "left supracondylar humerus fracture",
            "no signs of compartment syndrome were noted during the post-op recovery"
          ]
        },
        "followup_questions": {
          "required_themes": [
            "timing of surgery",
            "neurovascular assessment details"
          ],
          "forbidden_terms": [
            "policy",
            "guideline"
          ]
        }
      }
    },
    {
      "test_id": "I25-BATCH1-002",
      "concern_id": "I25",
      "description": "Safety_Signal and Preventability_Detective case with white, cold hand at arrival.",
      "patient_payload": "An 8-year-old female was brought to the emergency department at 09:30 PM after falling off her bike, resulting in a right supracondylar humerus fracture. Upon arrival, the patient exhibited a white, cold hand, and the radial pulse was absent. Immediate neurovascular assessment indicated severe ischemia. The orthopedic team was notified, but due to OR schedule constraints, the reduction was delayed until 11:00 AM the next day. During the prolonged wait, the patient developed signs of compartment syndrome, requiring fasciotomy after the delayed reduction. Post-operative assessment revealed persistent motor deficits in the AIN distribution. This case raises concerns about the preventability of the deteriorating neurovascular status.",
      "expectations": {
        "signal_generation": {
          "must_find_signals": [
            "white, cold hand at arrival",
            "absent radial pulse",
            "signs of compartment syndrome"
          ],
          "min_signal_count": 3
        },
        "event_summary": {
          "must_contain_phrases": [
            "right supracondylar humerus fracture",
            "persistent motor deficits in the AIN distribution"
          ]
        },
        "followup_questions": {
          "required_themes": [
            "justification for delay",
            "neurovascular assessment management"
          ],
          "forbidden_terms": [
            "policy",
            "guideline"
          ]
        }
      }
    },
    {
      "test_id": "I25-BATCH1-003",
      "concern_id": "I25",
      "description": "Documentation_Gap case with AIN palsy documented but summary states 'neurovascularly intact'.",
      "patient_payload": "A 6-year-old boy was evaluated at 08:15 PM after sustaining a left elbow injury while playing. Imaging confirmed a Gartland III supracondylar humerus fracture. The initial exam documented an absent AIN motor function with an 'OK sign' failure, but the discharge summary incorrectly stated that the patient was 'neurovascularly intact.' The surgical intervention was performed at 01:00 AM following a thorough neurovascular assessment, which included radial and ulnar nerve checks. Post-operative notes confirmed the presence of AIN palsy. This discrepancy raises concerns regarding the accuracy of documentation in the patient's records.",
      "expectations": {
        "signal_generation": {
          "must_find_signals": [
            "absent AIN motor function with an 'OK sign' failure",
            "Gartland III supracondylar humerus fracture",
            "discharge summary incorrectly stated that the patient was 'neurovascularly intact'"
          ],
          "min_signal_count": 3
        },
        "event_summary": {
          "must_contain_phrases": [
            "surgical intervention was performed at 01:00 AM",
            "discrepancy raises concerns regarding the accuracy of documentation"
          ]
        },
        "followup_questions": {
          "required_themes": [
            "documentation accuracy",
            "neurovascular assessment details"
          ],
          "forbidden_terms": [
            "policy",
            "guideline"
          ]
        }
      }
    },
    {
      "test_id": "I25-BATCH1-004",
      "concern_id": "I25",
      "description": "Preventability_Detective case with brachialis pucker sign requiring unavoidable open reduction.",
      "patient_payload": "A 9-year-old female presented at 07:45 PM after a fall from a swing, resulting in a left supracondylar humerus fracture. The orthopedic examination revealed a notable brachialis pucker sign, indicating significant soft tissue compromise. Neurovascular assessment showed a pink, warm hand with intact capillary refill, but the indication for closed reduction was poor due to the pucker sign. An open reduction was deemed necessary and performed at 10:30 PM. Post-operatively, the patient was closely monitored for complications, but the initial assessment raised questions about whether the need for an open reduction could have been prevented with more timely intervention.",
      "expectations": {
        "signal_generation": {
          "must_find_signals": [
            "brachialis pucker sign",
            "pink, warm hand with intact capillary refill",
            "open reduction was deemed necessary"
          ],
          "min_signal_count": 3
        },
        "event_summary": {
          "must_contain_phrases": [
            "left supracondylar humerus fracture",
            "questions about whether the need for an open reduction could have been prevented"
          ]
        },
        "followup_questions": {
          "required_themes": [
            "timeliness of intervention",
            "justification for open reduction"
          ],
          "forbidden_terms": [
            "policy",
            "guideline"
          ]
        }
      }
    },
    {
      "test_id": "I25-BATCH1-005",
      "concern_id": "I25",
      "description": "Safety_Signal and Follow-up stress case with escalating pain and late compartment syndrome recognition.",
      "patient_payload": "A 10-year-old male arrived at the emergency department at 11:00 PM after a sports-related injury causing a left supracondylar humerus fracture. Initial neurovascular assessment indicated a pink, warm hand, but the patient reported escalating pain levels over the next few hours, requiring increasing doses of opioids. Despite this, the orthopedic team delayed the surgical intervention until 04:00 AM due to staffing issues. At this time, the patient displayed late signs of compartment syndrome, including severe pain on passive stretch. Immediate fasciotomy was performed, and the case highlights the critical need for timely recognition of compartment syndrome in the context of escalating pain and opioid use.",
      "expectations": {
        "signal_generation": {
          "must_find_signals": [
            "escalating pain levels over the next few hours",
            "required increasing doses of opioids",
            "late signs of compartment syndrome"
          ],
          "min_signal_count": 3
        },
        "event_summary": {
          "must_contain_phrases": [
            "left supracondylar humerus fracture",
            "highlights the critical need for timely recognition of compartment syndrome"
          ]
        },
        "followup_questions": {
          "required_themes": [
            "timing of intervention",
            "pain management strategies"
          ],
          "forbidden_terms": [
            "policy",
            "guideline"
          ]
        }
      }
    }
  ]
}